Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.mcp.agentSetup.cliPrompt
source: # Install and Verify Starcat CLI ## Goal The current AI Agent installs the official Starcat CLI and completes version and read-only diagnostic checks. Official repository: ```text %1$@ ``` ## Installation ### 1. Detect the operating system Select the official command for the current environment. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Check the CLI version ```bash starcat version ``` If the current macOS/Linux shell has not refreshed PATH, use: ```bash "$HOME/.local/bin/starcat" version ``` On Windows PowerShell, locate the installation with: ```powershell (Get-Command starcat).Source ``` ### 3. Run read-only diagnostics ```bash starcat doctor ``` If the current macOS/Linux shell has not refreshed PATH, use: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Handle an unpaired CLI If diagnostics report that the CLI is not paired: 1. Stop further connection verification. 2. Report that the Starcat CLI is installed but not paired. 3. Instruct the user to open **Starcat > Settings > MCP Service**. 4. Instruct the user to use Starcat's **Copy Pairing Prompt** action to complete pairing. 5. Do not request a standalone pairing URI or Local API Key from the user. ## Boundaries - Use only Starcat's official installer. - Do not modify project files. - Do not execute Starcat write commands. - Do not request a Local API Key. - Do not construct a pairing URI or pairing command. - Unless installation fails, do not fetch extra GitHub Release API responses or print installer source. ## Final Report The current AI Agent reports: - Operating system and CPU architecture - Whether installation succeeded - CLI installation path - CLI version - `starcat doctor` result - Whether the user must continue with device pairing
ar: # تثبيت والتحقق من Starcat CLI ## الهدف يقوم وكيل الذكاء الاصطناعي الحالي بتثبيت Starcat CLI الرسمي وإكمال فحوصات الإصدار والتشخيص للقراءة فقط. المستودع الرسمي: ```text %1$@ ``` ## التثبيت ### 1. اكتشاف نظام التشغيل اختر الأمر الرسمي للبيئة الحالية. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. التحقق من إصدار CLI ```bash starcat version ``` إذا لم يتم تحديث PATH في جلسة macOS/Linux الحالية، استخدم: ```bash "$HOME/.local/bin/starcat" version ``` في Windows PowerShell، حدد موقع التثبيت باستخدام: ```powershell (Get-Command starcat).Source ``` ### 3. تشغيل التشخيص للقراءة فقط ```bash starcat doctor ``` إذا لم يتم تحديث PATH في جلسة macOS/Linux الحالية، استخدم: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. التعامل مع CLI غير مقترن إذا أبلغت التشخيصات أن CLI غير مقترن: 1. أوقف المزيد من التحقق من الاتصال. 2. أبلغ أن Starcat CLI مثبت ولكنه غير مقترن. 3. اطلب من المستخدم فتح **Starcat > الإعدادات > خدمة MCP**. 4. اطلب من المستخدم استخدام إجراء **نسخ مطالبة الاقتران** في Starcat لإكمال الاقتران. 5. لا تطلب URI اقتران مستقل أو مفتاح API محلي من المستخدم. ## الحدود - استخدم فقط المثبت الرسمي لـ Starcat. - لا تعدل ملفات المشروع. - لا تنفذ أوامر كتابة Starcat. - لا تطلب مفتاح API محلي. - لا تنشئ URI اقتران أو أمر اقتران. - ما لم يفشل التثبيت، لا تجلب ردود GitHub Release API إضافية أو تطبع مصدر المثبت. ## التقرير النهائي يبلغ وكيل الذكاء الاصطناعي الحالي: - نظام التشغيل وبنية وحدة المعالجة المركزية - ما إذا نجح التثبيت - مسار تثبيت CLI - إصدار CLI - نتيجة `starcat doctor` - ما إذا كان يجب على المستخدم المتابعة مع اقتران الجهاز
de: # Installieren und Überprüfen der Starcat CLI ## Ziel Der aktuelle KI-Agent installiert die offizielle Starcat CLI und führt Versions- und schreibgeschützte Diagnosechecks durch. Offizielles Repository: ```text %1$@ ``` ## Installation ### 1. Betriebssystem erkennen Wählen Sie den offiziellen Befehl für die aktuelle Umgebung. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. CLI-Version prüfen ```bash starcat version ``` Wenn die aktuelle macOS/Linux-Shell den PATH nicht aktualisiert hat, verwenden Sie: ```bash "$HOME/.local/bin/starcat" version ``` Unter Windows PowerShell finden Sie die Installation mit: ```powershell (Get-Command starcat).Source ``` ### 3. Schreibgeschützte Diagnose ausführen ```bash starcat doctor ``` Wenn die aktuelle macOS/Linux-Shell den PATH nicht aktualisiert hat, verwenden Sie: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Umgang mit ungepaarter CLI Wenn die Diagnose meldet, dass die CLI nicht gepaart ist: 1. Stoppen Sie die weitere Verbindungsüberprüfung. 2. Melden Sie, dass die Starcat CLI installiert, aber nicht gepaart ist. 3. Weisen Sie den Benutzer an, **Starcat > Einstellungen > MCP-Dienst** zu öffnen. 4. Weisen Sie den Benutzer an, die Aktion **Pairing-Prompt kopieren** von Starcat zu verwenden, um das Pairing abzuschließen. 5. Fordern Sie keinen eigenständigen Pairing-URI oder lokalen API-Schlüssel vom Benutzer an. ## Grenzen - Verwenden Sie nur den offiziellen Installer von Starcat. - Ändern Sie keine Projektdateien. - Führen Sie keine Schreibbefehle von Starcat aus. - Fordern Sie keinen lokalen API-Schlüssel an. - Erstellen Sie keinen Pairing-URI oder Pairing-Befehl. - Sofern die Installation nicht fehlschlägt, rufen Sie keine zusätzlichen GitHub Release API-Antworten ab und drucken Sie keine Installationsquellen. ## Abschlussbericht Der aktuelle KI-Agent berichtet: - Betriebssystem und CPU-Architektur - Ob die Installation erfolgreich war - CLI-Installationspfad - CLI-Version - Ergebnis von `starcat doctor` - Ob der Benutzer mit der Gerätekopplung fortfahren muss
es: # Instalar y verificar Starcat CLI ## Objetivo El agente de IA actual instala la CLI oficial de Starcat y completa comprobaciones de versión y diagnóstico de solo lectura. Repositorio oficial: ```text %1$@ ``` ## Instalación ### 1. Detectar el sistema operativo Selecciona el comando oficial para el entorno actual. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Verificar la versión de la CLI ```bash starcat version ``` Si el shell actual de macOS/Linux no ha actualizado PATH, usa: ```bash "$HOME/.local/bin/starcat" version ``` En Windows PowerShell, localiza la instalación con: ```powershell (Get-Command starcat).Source ``` ### 3. Ejecutar diagnóstico de solo lectura ```bash starcat doctor ``` Si el shell actual de macOS/Linux no ha actualizado PATH, usa: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Manejar una CLI no emparejada Si el diagnóstico informa que la CLI no está emparejada: 1. Detén la verificación de conexión. 2. Informa que la CLI de Starcat está instalada pero no emparejada. 3. Indica al usuario que abra **Starcat > Ajustes > Servicio MCP**. 4. Indica al usuario que use la acción **Copiar indicación de emparejamiento** de Starcat para completar el emparejamiento. 5. No solicites al usuario un URI de emparejamiento independiente ni una clave API local. ## Límites - Usa solo el instalador oficial de Starcat. - No modifiques archivos del proyecto. - No ejecutes comandos de escritura de Starcat. - No solicites una clave API local. - No construyas un URI de emparejamiento ni un comando de emparejamiento. - A menos que la instalación falle, no obtengas respuestas adicionales de la API de GitHub Release ni imprimas la fuente del instalador. ## Informe final El agente de IA actual informa: - Sistema operativo y arquitectura de CPU - Si la instalación fue exitosa - Ruta de instalación de la CLI - Versión de la CLI - Resultado de `starcat doctor` - Si el usuario debe continuar con el emparejamiento del dispositivo
fr: # Installer et vérifier Starcat CLI ## Objectif L'agent IA actuel installe la CLI officielle de Starcat et effectue des vérifications de version et de diagnostic en lecture seule. Dépôt officiel : ```text %1$@ ``` ## Installation ### 1. Détecter le système d'exploitation Sélectionnez la commande officielle pour l'environnement actuel. macOS / Linux : ```bash %2$@ ``` Windows PowerShell : ```powershell %3$@ ``` ### 2. Vérifier la version de la CLI ```bash starcat version ``` Si le shell macOS/Linux actuel n'a pas actualisé PATH, utilisez : ```bash "$HOME/.local/bin/starcat" version ``` Sous Windows PowerShell, localisez l'installation avec : ```powershell (Get-Command starcat).Source ``` ### 3. Exécuter les diagnostics en lecture seule ```bash starcat doctor ``` Si le shell macOS/Linux actuel n'a pas actualisé PATH, utilisez : ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Gérer une CLI non appairée Si les diagnostics indiquent que la CLI n'est pas appairée : 1. Arrêtez toute vérification de connexion ultérieure. 2. Signalez que la CLI Starcat est installée mais pas appairée. 3. Demandez à l'utilisateur d'ouvrir **Starcat > Réglages > Service MCP**. 4. Demandez à l'utilisateur d'utiliser l'action **Copier l'invite d'appairage** de Starcat pour terminer l'appairage. 5. Ne demandez pas d'URI d'appairage autonome ou de clé API locale à l'utilisateur. ## Limites - Utilisez uniquement l'installateur officiel de Starcat. - Ne modifiez pas les fichiers du projet. - N'exécutez pas de commandes d'écriture Starcat. - Ne demandez pas de clé API locale. - Ne construisez pas d'URI d'appairage ou de commande d'appairage. - Sauf en cas d'échec d'installation, ne récupérez pas de réponses supplémentaires de l'API GitHub Release et n'imprimez pas la source de l'installateur. ## Rapport final L'agent IA actuel rapporte : - Système d'exploitation et architecture du processeur - Succès ou échec de l'installation - Chemin d'installation de la CLI - Version de la CLI - Résultat de `starcat doctor` - Si l'utilisateur doit poursuivre avec l'appairage de l'appareil
id: # Instal dan Verifikasi Starcat CLI ## Tujuan Agen AI saat ini menginstal Starcat CLI resmi dan menyelesaikan pemeriksaan versi serta diagnostik hanya-baca. Repositori resmi: ```text %1$@ ``` ## Instalasi ### 1. Deteksi sistem operasi Pilih perintah resmi untuk lingkungan saat ini. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Periksa versi CLI ```bash starcat version ``` Jika shell macOS/Linux saat ini belum menyegarkan PATH, gunakan: ```bash "$HOME/.local/bin/starcat" version ``` Di Windows PowerShell, temukan instalasi dengan: ```powershell (Get-Command starcat).Source ``` ### 3. Jalankan diagnostik hanya-baca ```bash starcat doctor ``` Jika shell macOS/Linux saat ini belum menyegarkan PATH, gunakan: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Tangani CLI yang tidak dipasangkan Jika diagnostik melaporkan bahwa CLI tidak dipasangkan: 1. Hentikan verifikasi koneksi lebih lanjut. 2. Laporkan bahwa Starcat CLI telah terinstal tetapi tidak dipasangkan. 3. Instruksikan pengguna untuk membuka **Starcat > Pengaturan > Layanan MCP**. 4. Instruksikan pengguna untuk menggunakan tindakan **Salin Prompt Pemasangan** Starcat untuk menyelesaikan pemasangan. 5. Jangan meminta URI pemasangan mandiri atau Kunci API Lokal dari pengguna. ## Batasan - Gunakan hanya penginstal resmi Starcat. - Jangan memodifikasi file proyek. - Jangan menjalankan perintah tulis Starcat. - Jangan meminta Kunci API Lokal. - Jangan membuat URI pemasangan atau perintah pemasangan. - Kecuali instalasi gagal, jangan mengambil respons API Rilis GitHub tambahan atau mencetak sumber penginstal. ## Laporan Akhir Agen AI saat ini melaporkan: - Sistem operasi dan arsitektur CPU - Apakah instalasi berhasil - Jalur instalasi CLI - Versi CLI - Hasil `starcat doctor` - Apakah pengguna harus melanjutkan dengan pemasangan perangkat
it: # Installa e verifica Starcat CLI ## Obiettivo L'agente AI corrente installa la CLI ufficiale di Starcat e completa i controlli diagnostici di versione e di sola lettura. Repository ufficiale: ```text %1$@ ``` ## Installazione ### 1. Rileva il sistema operativo Seleziona il comando ufficiale per l'ambiente corrente. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Controlla la versione della CLI ```bash starcat version ``` Se la shell corrente macOS/Linux non ha aggiornato PATH, usa: ```bash "$HOME/.local/bin/starcat" version ``` Su Windows PowerShell, individua l'installazione con: ```powershell (Get-Command starcat).Source ``` ### 3. Esegui diagnostica di sola lettura ```bash starcat doctor ``` Se la shell corrente macOS/Linux non ha aggiornato PATH, usa: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Gestisci una CLI non abbinata Se la diagnostica segnala che la CLI non è abbinata: 1. Interrompi ulteriori verifiche di connessione. 2. Segnala che la CLI di Starcat è installata ma non abbinata. 3. Indica all'utente di aprire **Starcat > Impostazioni > Servizio MCP**. 4. Indica all'utente di usare l'azione **Copia prompt di abbinamento** di Starcat per completare l'abbinamento. 5. Non richiedere all'utente un URI di abbinamento autonomo o una chiave API locale. ## Limiti - Usa solo l'installer ufficiale di Starcat. - Non modificare i file del progetto. - Non eseguire comandi di scrittura di Starcat. - Non richiedere una chiave API locale. - Non costruire un URI o un comando di abbinamento. - A meno che l'installazione non fallisca, non recuperare risposte API aggiuntive di GitHub Release né stampare la fonte dell'installer. ## Report finale L'agente AI corrente segnala: - Sistema operativo e architettura CPU - Se l'installazione è riuscita - Percorso di installazione della CLI - Versione della CLI - Risultato di `starcat doctor` - Se l'utente deve continuare con l'abbinamento del dispositivo
ja: # Starcat CLIのインストールと確認 ## 目標 現在のAIエージェントが公式のStarcat CLIをインストールし、バージョンと読み取り専用の診断チェックを完了します。 公式リポジトリ: ```text %1$@ ``` ## インストール ### 1. オペレーティングシステムを検出 現在の環境に適した公式コマンドを選択します。 macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. CLIバージョンを確認 ```bash starcat version ``` 現在のmacOS/LinuxシェルでPATHが更新されていない場合は、以下を使用: ```bash "$HOME/.local/bin/starcat" version ``` Windows PowerShellでは、以下でインストール場所を確認: ```powershell (Get-Command starcat).Source ``` ### 3. 読み取り専用の診断を実行 ```bash starcat doctor ``` 現在のmacOS/LinuxシェルでPATHが更新されていない場合は、以下を使用: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. ペアリングされていないCLIへの対応 診断でCLIがペアリングされていないと報告された場合: 1. これ以上の接続確認を停止します。 2. Starcat CLIはインストールされているがペアリングされていないことを報告します。 3. ユーザーに **Starcat > 設定 > MCPサービス** を開くよう指示します。 4. ユーザーにStarcatの **ペアリングプロンプトをコピー** アクションを使用してペアリングを完了するよう指示します。 5. スタンドアロンのペアリングURIやローカルAPIキーをユーザーに要求しないでください。 ## 制限 - Starcatの公式インストーラーのみを使用します。 - プロジェクトファイルを変更しないでください。 - Starcatの書き込みコマンドを実行しないでください。 - ローカルAPIキーを要求しないでください。 - ペアリングURIやペアリングコマンドを構築しないでください。 - インストールが失敗しない限り、追加のGitHub Release APIレスポンスを取得したり、インストーラーのソースを表示したりしないでください。 ## 最終報告 現在のAIエージェントは以下を報告します: - オペレーティングシステムとCPUアーキテクチャ - インストールが成功したかどうか - CLIのインストールパス - CLIバージョン - `starcat doctor`の結果 - ユーザーがデバイスペアリングを続行する必要があるかどうか
ko: # Starcat CLI 설치 및 확인 ## 목표 현재 AI 에이전트가 공식 Starcat CLI를 설치하고 버전 및 읽기 전용 진단 검사를 완료합니다. 공식 저장소: ```text %1$@ ``` ## 설치 ### 1. 운영 체제 감지 현재 환경에 맞는 공식 명령을 선택합니다. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. CLI 버전 확인 ```bash starcat version ``` 현재 macOS/Linux 셸에서 PATH가 새로고침되지 않은 경우 다음을 사용하세요: ```bash "$HOME/.local/bin/starcat" version ``` Windows PowerShell에서는 다음으로 설치 위치를 찾습니다: ```powershell (Get-Command starcat).Source ``` ### 3. 읽기 전용 진단 실행 ```bash starcat doctor ``` 현재 macOS/Linux 셸에서 PATH가 새로고침되지 않은 경우 다음을 사용하세요: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. 페어링되지 않은 CLI 처리 진단 결과 CLI가 페어링되지 않은 것으로 보고되면: 1. 추가 연결 확인을 중지합니다. 2. Starcat CLI가 설치되었지만 페어링되지 않았다고 보고합니다. 3. 사용자에게 **Starcat > 설정 > MCP 서비스**를 열도록 안내합니다. 4. 사용자에게 Starcat의 **페어링 프롬프트 복사** 작업을 사용하여 페어링을 완료하도록 안내합니다. 5. 사용자에게 독립형 페어링 URI 또는 로컬 API 키를 요청하지 마십시오. ## 경계 - Starcat의 공식 설치 프로그램만 사용하십시오. - 프로젝트 파일을 수정하지 마십시오. - Starcat 쓰기 명령을 실행하지 마십시오. - 로컬 API 키를 요청하지 마십시오. - 페어링 URI 또는 페어링 명령을 구성하지 마십시오. - 설치가 실패하지 않는 한, 추가 GitHub 릴리스 API 응답을 가져오거나 설치 프로그램 소스를 출력하지 마십시오. ## 최종 보고서 현재 AI 에이전트가 보고합니다: - 운영 체제 및 CPU 아키텍처 - 설치 성공 여부 - CLI 설치 경로 - CLI 버전 - `starcat doctor` 결과 - 사용자가 장치 페어링을 계속해야 하는지 여부
nl: # Starcat CLI installeren en verifiëren ## Doel De huidige AI-agent installeert de officiële Starcat CLI en voltooit versie- en alleen-lezen diagnostische controles. Officiële repository: ```text %1$@ ``` ## Installatie ### 1. Besturingssysteem detecteren Selecteer de officiële opdracht voor de huidige omgeving. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. CLI-versie controleren ```bash starcat version ``` Als de huidige macOS/Linux-shell PATH niet heeft ververst, gebruik dan: ```bash "$HOME/.local/bin/starcat" version ``` Zoek in Windows PowerShell de installatie met: ```powershell (Get-Command starcat).Source ``` ### 3. Alleen-lezen diagnostiek uitvoeren ```bash starcat doctor ``` Als de huidige macOS/Linux-shell PATH niet heeft ververst, gebruik dan: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Omgaan met een niet-gekoppelde CLI Als diagnostiek meldt dat de CLI niet is gekoppeld: 1. Stop verdere verbindingsverificatie. 2. Meld dat de Starcat CLI is geïnstalleerd maar niet gekoppeld. 3. Geef de gebruiker de instructie om **Starcat > Instellingen > MCP-service** te openen. 4. Geef de gebruiker de instructie om de actie **Koppelingsprompt kopiëren** van Starcat te gebruiken om de koppeling te voltooien. 5. Vraag niet om een zelfstandige koppelings-URI of lokale API-sleutel van de gebruiker. ## Grenzen - Gebruik alleen de officiële installer van Starcat. - Wijzig geen projectbestanden. - Voer geen Starcat-schrijfopdrachten uit. - Vraag niet om een lokale API-sleutel. - Stel geen koppelings-URI of koppelingsopdracht samen. - Haal, tenzij de installatie mislukt, geen extra GitHub Release API-antwoorden op en print geen installer-bron. ## Eindverslag De huidige AI-agent rapporteert: - Besturingssysteem en CPU-architectuur - Of de installatie is geslaagd - CLI-installatiepad - CLI-versie - Resultaat van `starcat doctor` - Of de gebruiker moet doorgaan met apparaatkoppeling
pl: # Zainstaluj i zweryfikuj Starcat CLI ## Cel Obecny agent AI instaluje oficjalne Starcat CLI i wykonuje podstawowe sprawdzenie wersji oraz diagnostykę tylko do odczytu. Oficjalne repozytorium: ```text %1$@ ``` ## Instalacja ### 1. Wykryj system operacyjny Wybierz oficjalne polecenie dla bieżącego środowiska. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Sprawdź wersję CLI ```bash starcat version ``` Jeśli bieżąca powłoka macOS/Linux nie odświeżyła PATH, użyj: ```bash "$HOME/.local/bin/starcat" version ``` W Windows PowerShell znajdź instalację za pomocą: ```powershell (Get-Command starcat).Source ``` ### 3. Uruchom diagnostykę tylko do odczytu ```bash starcat doctor ``` Jeśli bieżąca powłoka macOS/Linux nie odświeżyła PATH, użyj: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Obsługa niesparowanego CLI Jeśli diagnostyka zgłosi, że CLI nie jest sparowane: 1. Zatrzymaj dalszą weryfikację połączenia. 2. Zgłoś, że Starcat CLI jest zainstalowane, ale nie sparowane. 3. Poinstruuj użytkownika, aby otworzył **Starcat > Ustawienia > MCP Service**. 4. Poinstruuj użytkownika, aby użył akcji **Kopiuj prompt parowania** w Starcat, aby zakończyć parowanie. 5. Nie pytaj użytkownika o samodzielny URI parowania ani lokalny klucz API. ## Granice - Używaj tylko oficjalnego instalatora Starcat. - Nie modyfikuj plików projektu. - Nie wykonuj poleceń zapisu Starcat. - Nie pytaj o lokalny klucz API. - Nie konstruuj URI parowania ani polecenia parowania. - Chyba że instalacja się nie powiedzie, nie pobieraj dodatkowych odpowiedzi API GitHub Release ani nie drukuj źródła instalatora. ## Raport końcowy Obecny agent AI raportuje: - System operacyjny i architekturę CPU - Czy instalacja się powiodła - Ścieżkę instalacji CLI - Wersję CLI - Wynik `starcat doctor` - Czy użytkownik musi kontynuować parowanie urządzenia
pt_br: # Instalar e Verificar Starcat CLI ## Objetivo O Agente de IA atual instala a CLI oficial do Starcat e conclui verificações de diagnóstico de versão e somente leitura. Repositório oficial: ```text %1$@ ``` ## Instalação ### 1. Detectar o sistema operacional Selecione o comando oficial para o ambiente atual. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Verificar a versão da CLI ```bash starcat version ``` Se o shell atual do macOS/Linux não tiver atualizado o PATH, use: ```bash "$HOME/.local/bin/starcat" version ``` No Windows PowerShell, localize a instalação com: ```powershell (Get-Command starcat).Source ``` ### 3. Executar diagnósticos somente leitura ```bash starcat doctor ``` Se o shell atual do macOS/Linux não tiver atualizado o PATH, use: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Lidar com uma CLI não emparelhada Se os diagnósticos informarem que a CLI não está emparelhada: 1. Interrompa a verificação de conexão adicional. 2. Informe que a CLI do Starcat está instalada, mas não emparelhada. 3. Instrua o usuário a abrir **Starcat > Ajustes > Serviço MCP**. 4. Instrua o usuário a usar a ação **Copiar Comando de Emparelhamento** do Starcat para concluir o emparelhamento. 5. Não solicite um URI de emparelhamento autônomo ou Chave de API Local ao usuário. ## Limites - Use apenas o instalador oficial do Starcat. - Não modifique arquivos do projeto. - Não execute comandos de gravação do Starcat. - Não solicite uma Chave de API Local. - Não construa um URI de emparelhamento ou comando de emparelhamento. - A menos que a instalação falhe, não busque respostas adicionais da API de Lançamentos do GitHub nem imprima o código-fonte do instalador. ## Relatório Final O Agente de IA atual relata: - Sistema operacional e arquitetura da CPU - Se a instalação foi bem-sucedida - Caminho de instalação da CLI - Versão da CLI - Resultado de `starcat doctor` - Se o usuário deve continuar com o emparelhamento do dispositivo
ru: # Установка и проверка Starcat CLI ## Цель Текущий ИИ-агент устанавливает официальный Starcat CLI и выполняет проверку версии и диагностику только для чтения. Официальный репозиторий: ```text %1$@ ``` ## Установка ### 1. Определение операционной системы Выберите официальную команду для текущей среды. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Проверка версии CLI ```bash starcat version ``` Если текущая оболочка macOS/Linux не обновила PATH, используйте: ```bash "$HOME/.local/bin/starcat" version ``` В Windows PowerShell найдите установку с помощью: ```powershell (Get-Command starcat).Source ``` ### 3. Запуск диагностики только для чтения ```bash starcat doctor ``` Если текущая оболочка macOS/Linux не обновила PATH, используйте: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Обработка несопряжённого CLI Если диагностика сообщает, что CLI не сопряжён: 1. Прекратите дальнейшую проверку соединения. 2. Сообщите, что Starcat CLI установлен, но не сопряжён. 3. Укажите пользователю открыть **Starcat > Настройки > MCP-сервис**. 4. Укажите пользователю использовать действие **Копировать запрос на сопряжение** в Starcat для завершения сопряжения. 5. Не запрашивайте у пользователя отдельный URI сопряжения или локальный API-ключ. ## Границы - Используйте только официальный установщик Starcat. - Не изменяйте файлы проекта. - Не выполняйте команды записи Starcat. - Не запрашивайте локальный API-ключ. - Не формируйте URI сопряжения или команду сопряжения. - Если установка не завершилась ошибкой, не загружайте дополнительные ответы GitHub Release API и не выводите источник установщика. ## Итоговый отчёт Текущий ИИ-агент сообщает: - Операционная система и архитектура процессора - Успешность установки - Путь установки CLI - Версия CLI - Результат `starcat doctor` - Необходимость продолжения сопряжения устройства
tr: # Starcat CLI'yı Kur ve Doğrula ## Hedef Mevcut Yapay Zeka Aracısı, resmi Starcat CLI'yı kurar ve sürüm ile salt okunur tanılama kontrollerini tamamlar. Resmi depo: ```text %1$@ ``` ## Kurulum ### 1. İşletim sistemini algıla Geçerli ortam için resmi komutu seçin. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. CLI sürümünü kontrol et ```bash starcat version ``` Mevcut macOS/Linux kabuğu PATH'i yenilemediyse şunu kullanın: ```bash "$HOME/.local/bin/starcat" version ``` Windows PowerShell'de kurulumu şununla bulun: ```powershell (Get-Command starcat).Source ``` ### 3. Salt okunur tanılama çalıştır ```bash starcat doctor ``` Mevcut macOS/Linux kabuğu PATH'i yenilemediyse şunu kullanın: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Eşlenmemiş CLI'yı yönet Tanılama, CLI'nın eşlenmediğini bildirirse: 1. Daha fazla bağlantı doğrulamasını durdurun. 2. Starcat CLI'nın kurulu olduğunu ancak eşlenmediğini bildirin. 3. Kullanıcıya **Starcat > Ayarlar > MCP Servisi**'ni açmasını söyleyin. 4. Kullanıcıya eşlemeyi tamamlamak için Starcat'ın **Eşleme İstemini Kopyala** eylemini kullanmasını söyleyin. 5. Kullanıcıdan bağımsız bir eşleme URI'si veya Yerel API Anahtarı istemeyin. ## Sınırlar - Yalnızca Starcat'ın resmi yükleyicisini kullanın. - Proje dosyalarını değiştirmeyin. - Starcat yazma komutlarını çalıştırmayın. - Yerel API Anahtarı istemeyin. - Bir eşleme URI'si veya eşleme komutu oluşturmayın. - Kurulum başarısız olmadıkça, ek GitHub Release API yanıtları getirmeyin veya yükleyici kaynağını yazdırmayın. ## Son Rapor Mevcut Yapay Zeka Aracısı şunları raporlar: - İşletim sistemi ve CPU mimarisi - Kurulumun başarılı olup olmadığı - CLI kurulum yolu - CLI sürümü - `starcat doctor` sonucu - Kullanıcının cihaz eşlemesine devam etmesi gerekip gerekmediği
uk: # Встановлення та перевірка Starcat CLI ## Мета Поточний AI-агент встановлює офіційний Starcat CLI та виконує перевірку версії та діагностику лише для читання. Офіційний репозиторій: ```text %1$@ ``` ## Встановлення ### 1. Визначення операційної системи Виберіть офіційну команду для поточного середовища. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Перевірка версії CLI ```bash starcat version ``` Якщо поточна оболонка macOS/Linux не оновила PATH, використовуйте: ```bash "$HOME/.local/bin/starcat" version ``` У Windows PowerShell знайдіть встановлення за допомогою: ```powershell (Get-Command starcat).Source ``` ### 3. Виконання діагностики лише для читання ```bash starcat doctor ``` Якщо поточна оболонка macOS/Linux не оновила PATH, використовуйте: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Обробка несполученого CLI Якщо діагностика повідомляє, що CLI не сполучено: 1. Припиніть подальшу перевірку з'єднання. 2. Повідомте, що Starcat CLI встановлено, але не сполучено. 3. Вкажіть користувачеві відкрити **Starcat > Налаштування > MCP Service**. 4. Вкажіть користувачеві використати дію **Копіювати запит на сполучення** у Starcat для завершення сполучення. 5. Не запитуйте окремий URI сполучення або локальний API-ключ у користувача. ## Межі - Використовуйте лише офіційний інсталятор Starcat. - Не змінюйте файли проєкту. - Не виконуйте команди запису Starcat. - Не запитуйте локальний API-ключ. - Не формуйте URI сполучення або команду сполучення. - Якщо встановлення не завершилося помилкою, не отримуйте додаткові відповіді GitHub Release API та не друкуйте джерело інсталятора. ## Підсумковий звіт Поточний AI-агент повідомляє: - Операційну систему та архітектуру процесора - Чи вдалося встановлення - Шлях встановлення CLI - Версію CLI - Результат `starcat doctor` - Чи потрібно користувачеві продовжити сполучення пристрою
vi: # Cài đặt và xác minh Starcat CLI ## Mục tiêu Tác nhân AI hiện tại cài đặt Starcat CLI chính thức và hoàn tất kiểm tra phiên bản và chẩn đoán chỉ đọc. Kho lưu trữ chính thức: ```text %1$@ ``` ## Cài đặt ### 1. Phát hiện hệ điều hành Chọn lệnh chính thức cho môi trường hiện tại. macOS / Linux: ```bash %2$@ ``` Windows PowerShell: ```powershell %3$@ ``` ### 2. Kiểm tra phiên bản CLI ```bash starcat version ``` Nếu shell macOS/Linux hiện tại chưa làm mới PATH, hãy dùng: ```bash "$HOME/.local/bin/starcat" version ``` Trên Windows PowerShell, xác định vị trí cài đặt bằng: ```powershell (Get-Command starcat).Source ``` ### 3. Chạy chẩn đoán chỉ đọc ```bash starcat doctor ``` Nếu shell macOS/Linux hiện tại chưa làm mới PATH, hãy dùng: ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. Xử lý CLI chưa được ghép nối Nếu chẩn đoán báo cáo CLI chưa được ghép nối: 1. Dừng xác minh kết nối thêm. 2. Báo cáo rằng Starcat CLI đã được cài đặt nhưng chưa được ghép nối. 3. Hướng dẫn người dùng mở **Starcat > Cài đặt > Dịch vụ MCP**. 4. Hướng dẫn người dùng sử dụng hành động **Sao chép lời nhắc ghép nối** của Starcat để hoàn tất ghép nối. 5. Không yêu cầu URI ghép nối độc lập hoặc Khóa API cục bộ từ người dùng. ## Ranh giới - Chỉ sử dụng trình cài đặt chính thức của Starcat. - Không sửa đổi tệp dự án. - Không thực thi lệnh ghi của Starcat. - Không yêu cầu Khóa API cục bộ. - Không xây dựng URI ghép nối hoặc lệnh ghép nối. - Trừ khi cài đặt thất bại, không tìm nạp phản hồi API GitHub Release bổ sung hoặc in nguồn trình cài đặt. ## Báo cáo cuối cùng Tác nhân AI hiện tại báo cáo: - Hệ điều hành và kiến trúc CPU - Cài đặt thành công hay không - Đường dẫn cài đặt CLI - Phiên bản CLI - Kết quả `starcat doctor` - Người dùng có cần tiếp tục ghép nối thiết bị hay không
zh_hans: # 安装并验证 Starcat CLI ## 任务目标 当前 AI Agent 安装官方 Starcat CLI，并完成版本检查和只读诊断。 官方仓库： ```text %1$@ ``` ## 安装步骤 ### 1. 判断操作系统 根据当前运行环境选择对应的官方安装命令。 macOS / Linux： ```bash %2$@ ``` Windows PowerShell： ```powershell %3$@ ``` ### 2. 检查 CLI 版本 ```bash starcat version ``` 如果 macOS/Linux 当前 shell 尚未刷新 PATH，改用： ```bash "$HOME/.local/bin/starcat" version ``` Windows PowerShell 可通过以下命令查找安装路径： ```powershell (Get-Command starcat).Source ``` ### 3. 执行只读诊断 ```bash starcat doctor ``` 如果 macOS/Linux 当前 shell 尚未刷新 PATH，改用： ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. 处理未配对状态 如果诊断结果显示 CLI 尚未配对： 1. 停止后续连接验证。 2. 报告“Starcat CLI 已安装，但尚未配对”。 3. 提示用户打开 Starcat 的「设置 → MCP Service」。 4. 提示用户使用 Starcat 提供的“复制配对提示词”功能完成配对。 5. 不向用户索取单独的 pairing URI 或 Local API Key。 ## 操作边界 - 只使用 Starcat 官方安装脚本。 - 不修改当前项目文件。 - 不执行 Starcat 写入命令。 - 不索取 Local API Key。 - 不自行构造 pairing URI 或配对命令。 - 除非安装失败，否则不额外抓取 GitHub Release API 响应或打印安装脚本源码。 ## 完成后报告 当前 AI Agent 最终报告： - 操作系统和 CPU 架构 - CLI 是否安装成功 - CLI 安装路径 - CLI 版本 - `starcat doctor` 结果 - 是否需要用户继续完成设备配对
zh_hant: # 安裝並驗證 Starcat CLI ## 任務目標 當前 AI Agent 安裝官方 Starcat CLI，並完成版本檢查和唯讀診斷。 官方倉庫： ```text %1$@ ``` ## 安裝步驟 ### 1. 判斷作業系統 根據目前執行環境選擇對應的官方安裝命令。 macOS / Linux： ```bash %2$@ ``` Windows PowerShell： ```powershell %3$@ ``` ### 2. 檢查 CLI 版本 ```bash starcat version ``` 如果 macOS/Linux 目前 shell 尚未重新整理 PATH，改用： ```bash "$HOME/.local/bin/starcat" version ``` Windows PowerShell 可透過以下命令尋找安裝路徑： ```powershell (Get-Command starcat).Source ``` ### 3. 執行唯讀診斷 ```bash starcat doctor ``` 如果 macOS/Linux 目前 shell 尚未重新整理 PATH，改用： ```bash "$HOME/.local/bin/starcat" doctor ``` ### 4. 處理未配對狀態 如果診斷結果顯示 CLI 尚未配對： 1. 停止後續連線驗證。 2. 報告「Starcat CLI 已安裝，但尚未配對」。 3. 提示使用者開啟 Starcat 的「設定 → MCP Service」。 4. 提示使用者使用 Starcat 提供的「複製配對提示詞」功能完成配對。 5. 不向使用者索取單獨的 pairing URI 或 Local API Key。 ## 操作邊界 - 只使用 Starcat 官方安裝腳本。 - 不修改目前專案檔案。 - 不執行 Starcat 寫入命令。 - 不索取 Local API Key。 - 不自行建構 pairing URI 或配對命令。 - 除非安裝失敗，否則不額外抓取 GitHub Release API 回應或列印安裝腳本原始碼。 ## 完成後報告 當前 AI Agent 最終報告： - 作業系統和 CPU 架構 - CLI 是否安裝成功 - CLI 安裝路徑 - CLI 版本 - `starcat doctor` 結果 - 是否需要使用者繼續完成裝置配對
